---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArrArray.Item(System.Int32)
source: html/efeb5796-d115-a183-daa5-a6c84f99d89a.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual ModelCurveArray this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.